## Eksik Veriler (Missing Values)

In [1]:
import pandas as pd
import numpy as np

In [2]:
np.nan

nan

In [3]:
pd.NA

In [4]:
pd.NaT

NaT

In [5]:
np.nan == np.nan # degerini bilmedigin icin esit degildir

False

In [6]:
df_ms = pd.read_csv("movie_scores.csv")
df_ms

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [7]:
df_ms.isna() # butun tablodaki eksik degerleri True olarak gosterir

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [8]:
df_ms.isna().sum() # her sutundaki eksik degerlerin sayisini gosterir

first_name          1
last_name           1
age                 1
sex                 1
pre_movie_score     2
post_movie_score    2
dtype: int64

In [9]:
df_ms.info() # var olan ve olmayan degerleri gosterir

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   first_name        4 non-null      object
 1   last_name         4 non-null      object
 2   age               4 non-null      float64
 3   sex               4 non-null      object
 4   pre_movie_score   3 non-null      float64
 5   post_movie_score  3 non-null      float64
dtypes: float64(3), object(3)
memory usage: 372.0+ bytes

In [10]:
df_ms.notna() # eksik olmayan degerleri True olarak gosterir

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [11]:
df_ms.notna().sum() # her sutundaki eksik olmayan degerlerin sayisini gosterir

first_name          4
last_name           4
age                 4
sex                 4
pre_movie_score     3
post_movie_score    3
dtype: int64

In [12]:
df_ms.head(6)

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [13]:
df_ms["pre_movie_score"].notna()  # sadece pre_movie_score sutunundaki eksik olmayan degerleri True, False olarak gosterir

0     True
1    False
2    False
3     True
4     True
Name: pre_movie_score, dtype: bool

In [14]:
df_ms[df_ms["pre_movie_score"].notna()] # sadece pre_movie_score sutunundaki eksik olmayan satirlari gosterir

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [15]:
df_ms[df_ms["pre_movie_score"].isna()] # sadece pre_movie_score sutunundaki eksik olan satirlari gosterir

  first_name last_name   age  sex  pre_movie_score  post_movie_score
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN

In [16]:
df_ms[(df_ms["pre_movie_score"].isna()) & (df_ms["age"].notna())] # pre_movie_score sutunundaki eksik olan ve age sutunundaki eksik olmayan satirlari gosterir

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0   m              NaN               NaN

## Eksik  Verilere 3 Sey Yapilabilir

In [17]:
# 1 ) Dokunmadan birakilabilir
# 2 ) Drop edilebilir (Satir veya Sutun olarak)(Genellikle veri silinmez cunku veri kaybi olur)
# 3 ) Mantikli bir sekilde doldurulabilir (Arastirma, Ortalama, Medyan, Mod, Ileri Doldurma, Geri Doldurma vb.)

In [18]:
# 1. Yol - Dokunmadan birakmak
df_ms # eksik verilere yapabilecegimiz hicbir sey yoksa dokunmadan birakabiliriz

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [19]:
# 2. Yol - Drop etmek
df_ms.dropna() # eksik deger iceren tum satirlari siler

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [20]:
df_ms.dropna(axis = 0, how = "any") # axis=0 satir bazinda, how=any herhangi bir eksik deger varsa siler (default degerler)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [21]:
df_ms.dropna(how = "all") # tum degerleri eksik olan satirlari siler
# genellikle daha mantikli

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [22]:
df_ms.dropna(thresh = 4) # satirda en az 4 adet dolu deger varsa satiri tutar

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [23]:
df_ms.dropna(thresh = 5) # satirda en az 5 tane dolu deger varsa satiri tutar

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [24]:
df_ms.dropna(axis = 1) # 1 tane bile eksik deger iceren tum sutunlari siler
# tum satirlarda en az birer eksik veri oldugundan tum verileri siler

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [25]:
df_ms.dropna(axis = 1, thresh = 4) # en az 4 tane dolu deger iceren sutunlari tutar
# genellikle sutun dusurme olayi tercih edilmez cunku veri kaybi olur

  first_name last_name   age  sex
0        Tom     Hanks  63.0    m
1        NaN       NaN   NaN  NaN
2       Hugh   Jackman  51.0    m
3      Oprah   Winfrey  66.0    f
4       Emma     Stone  31.0    f

In [26]:
# 3. Yol - Doldurmak
df_ms.dropna(how = "all", inplace = True) # once tum degerleri eksik olan satirlari sileriz
df_ms

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [27]:
df_ms["pre_movie_score"].fillna(9.5) # pre_movie_score sutunundaki eksik degerleri 9.5 ile doldurur

0    8.0
2    9.5
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [28]:
df_ms["pre_movie_score"].fillna(df_ms.pre_movie_score.mean()) # pre_movie_score sutunundaki eksik degerleri sutunun ortalamasi ile doldurur

0    8.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [31]:
df_mpg = pd.read_csv("mpg.csv")
df_mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [32]:
df_mpg.shape

(398, 9)

In [33]:
df_mpg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    398 non-null    object
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    int64
 8   name          398 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.1+ KB

In [34]:
df_mpg.horsepower.value_counts()

horsepower
150    22
90     20
88     19
110    18
100    17
       ..
77      1
132     1
64      1
116     1
82      1
Name: count, Length: 94, dtype: int64

In [37]:
df_mpg[df_mpg.horsepower == "?"]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
32,25.0,4,98.0,?,2046,19.0,71,1,ford pinto
126,21.0,6,200.0,?,2875,17.0,74,1,ford maverick
330,40.9,4,85.0,?,1835,17.3,80,2,renault lecar deluxe
336,23.6,4,140.0,?,2905,14.3,80,1,ford mustang cobra
354,34.5,4,100.0,?,2320,15.8,81,2,renault 18i
374,23.0,4,151.0,?,3035,20.5,82,1,amc concord dl

***horsepower sutununda sayisal degerden farkli degerler olduu icin bu sutunu .astype() ile float tipine ceviremeyiz***

***bu yuzden "?" olan degerleri once "nan" yapip daha sonra .astype() ile float tipine cevirebiliriz***

***"nan" olan degerleri int tipine donusturemeyiz ama float tipine donusturebiliriz***

***eger inte cevirmek istiyorsak once .dropna() ile o sutunlari atip daha sonra .astype(int) ile int yapabiliriz***

In [44]:
df_mpg["horsepower"].replace("?", np.nan, inplace = True) # "?" olan degerleri np.nan ile degistirir

In [39]:
df_mpg["horsepower"].astype(float) # artik bu sutunu float tipine cevirebiliriz

0      130.0
1      165.0
2      150.0
3      150.0
4      140.0
       ...
393     86.0
394     52.0
395     84.0
396     79.0
397     82.0
Name: horsepower, Length: 398, dtype: float64

In [45]:
df_mpg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    int64
 8   name          398 non-null    object
dtypes: float64(4), int64(4), object(1)
memory usage: 28.1+ KB

In [46]:
df_mpg.model_year.unique()

array([70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82])

In [47]:
df_mpg.model_year.value_counts()

model_year
73    40
78    36
76    34
82    31
75    30
80    29
79    29
81    29
70    29
71    28
72    28
77    28
74    27
Name: count, dtype: int64

### .groupby() metodu

In [ ]:
# .groupby(sutun ismi) bu metod ile bir sutundaki degerlere gore gruplama yapabiliriz

Common Options:

    mean(): Compute mean of groups
    sum(): Compute sum of group values
    size(): Compute group sizes
    count(): Compute count of group
    std(): Standard deviation of groups
    var(): Compute variance of groups
    sem(): Standard error of the mean of groups
    describe(): Generates descriptive statistics
    first(): Compute first of group values
    last(): Compute last of group values
    nth() : Take nth value, or a subset if n is a list
    min(): Compute min of group values
    max(): Compute max of group values
    
Full List at the Online Documentation: https://pandas.pydata.org/docs/reference/groupby.html

In [ ]:
df_mpg.groupby("model_year") # model_year sutunundaki her bir yila gore gruplama yapar, arkaplanda gruplama yapilir ama gosterilmez

In [51]:
df_mpg.groupby("model_year")["mpg"].mean() # model_year sutunundaki her bir yila gore gruplama yapar ve mpg sutunundaki degerlerin ortalamasini alir

model_year
70    17.689655
71    21.250000
72    18.714286
73    17.100000
74    22.703704
75    20.266667
76    21.573529
77    23.375000
78    24.061111
79    25.093103
80    33.696552
81    30.334483
82    31.709677
Name: mpg, dtype: float64

In [53]:
# 70 yilindan 80 yilina gecildikce araclarin mpg degerlerinin arttigini goruyoruz

In [55]:
df_mpg.groupby("model_year")["cylinders"].mean() # model_year sutunundaki her bir yila gore gruplama yapar ve cylinders sutunundaki degerlerin ortalamasini alir

model_year
70    6.758621
71    5.571429
72    5.821429
73    6.375000
74    5.259259
75    5.600000
76    5.647059
77    5.464286
78    5.361111
79    5.827586
80    4.137931
81    4.620690
82    4.193548
Name: cylinders, dtype: float64

In [65]:
df_mpg.groupby(["model_year", "cylinders"])["mpg"].mean() # birden fazla sutuna gore gruplama yapabiliriz

model_year  cylinders
70          4            25.285714
            6            20.500000
            8            14.111111
71          4            27.461538
            6            18.000000
            8            13.428571
72          3            19.000000
            4            23.428571
            8            13.615385
73          3            18.000000
            4            22.727273
            6            19.000000
            8            13.200000
74          4            27.800000
            6            17.857143
            8            14.200000
75          4            25.250000
            6            17.583333
            8            15.666667
76          4            26.766667
            6            20.000000
            8            14.666667
77          3            21.500000
            4            29.107143
            6            19.500000
            8            16.000000
78          4            29.576471
            5            20.300000
            6            19.066667
            8            19.050000
79          4            31.525000
            5            25.400000
            6            22.950000
            8            18.630000
80          3            23.700000
            4            34.612000
            5            36.400000
            6            25.900000
81          4            32.814286
            6            23.428571
            8            26.600000
82          4            32.071429
            6            28.333333
Name: mpg, dtype: float64

In [66]:
df_mpg.groupby("model_year").describe() # her bir yila gore gruplama yapar ve tum sayisal sutunlarin istatistiksel ozetini verir

             mpg                                                          \
           count       mean       std   min     25%    50%     75%   max
model_year
70          29.0  17.689655  5.339231   9.0  14.000  16.00  22.000  27.0
71          28.0  21.250000  6.591942  12.0  15.500  19.00  27.000  35.0
72          28.0  18.714286  5.435529  11.0  13.750  18.50  23.000  28.0
73          40.0  17.100000  4.700245  11.0  13.000  16.00  20.000  29.0
74          27.0  22.703704  6.420010  13.0  16.000  24.00  27.000  32.0
75          30.0  20.266667  4.940566  13.0  16.000  19.50  23.000  33.0
76          34.0  21.573529  5.889297  13.0  16.750  21.00  26.375  33.0
77          28.0  23.375000  6.675862  15.0  17.375  21.75  30.000  36.0
78          36.0  24.061111  6.898044  16.2  19.350  20.70  28.000  43.1
79          29.0  25.093103  6.794217  15.5  19.200  23.90  31.800  37.3
80          29.0  33.696552  7.037983  19.1  29.800  32.70  38.100  46.6
81          29.0  30.334483  5.591465  17.6  26.600  31.60  34.400  39.1
82          31.0  31.709677  5.392548  22.0  27.000  32.00  36.000  44.0

           cylinders            ... acceleration       origin            \
               count      mean  ...          75%   max  count      mean
model_year                      ...
70              29.0  6.758621  ...       15.000  20.5   29.0  1.310345
71              28.0  5.571429  ...       16.125  20.5   28.0  1.428571
72              28.0  5.821429  ...       16.625  23.5   28.0  1.535714
73              40.0  6.375000  ...       16.000  21.0   40.0  1.375000
74              27.0  5.259259  ...       17.000  21.0   27.0  1.666667
75              30.0  5.600000  ...       17.375  21.0   30.0  1.466667
76              34.0  5.647059  ...       17.550  22.2   34.0  1.470588
77              28.0  5.464286  ...       16.925  19.0   28.0  1.571429
78              36.0  5.361111  ...       16.825  21.5   36.0  1.611111
79              29.0  5.827586  ...       17.300  24.8   29.0  1.275862
80              29.0  4.137931  ...       18.700  23.7   29.0  2.206897
81              29.0  4.620690  ...       17.300  20.7   29.0  1.965517
82              31.0  4.193548  ...       18.000  24.6   31.0  1.645161


                 std  min  25%  50%  75%  max
model_year
70          0.603765  1.0  1.0  1.0  1.0  3.0
71          0.741798  1.0  1.0  1.0  2.0  3.0
72          0.792658  1.0  1.0  1.0  2.0  3.0
73          0.667467  1.0  1.0  1.0  2.0  3.0
74          0.832050  1.0  1.0  1.0  2.0  3.0
75          0.730297  1.0  1.0  1.0  2.0  3.0
76          0.706476  1.0  1.0  1.0  2.0  3.0
77          0.835711  1.0  1.0  1.0  2.0  3.0
78          0.837608  1.0  1.0  1.0  2.0  3.0
79          0.591400  1.0  1.0  1.0  1.0  3.0
80          0.818505  1.0  2.0  2.0  3.0  3.0
81          0.944259  1.0  1.0  2.0  3.0  3.0
82          0.914636  1.0  1.0  1.0  3.0  3.0

[13 rows x 56 columns]